app/controllers/categories_controller.rb

INSERT INTO `categories` (`title`, `created_at`, `updated_at`) VALUES ('sqwqa', '2015-07-09 10:51:59', '2015-07-09 10:51:59')
---
	def create
		@category= Category.new(category_params)
		if @category.save

SELECT  `categories`.* FROM `categories` WHERE `categories`.`id` = 1 LIMIT 1
---
	def show
		@category= Category.find(params[:id])