app/controllers/products_controller.rb

	def create
		@product= Product.new(product_params)
		if @product.save

      if params[:photos]
        #===== The magic is here ;)
        params[:photos].each { |photo|
          @product.pictures.create(photo: photo)
---
INSERT INTO `products` (`title`, `description`, `price`, `photo_file_name`, `photo_content_type`, `photo_file_size`, `photo_updated_at`, `video_file_file_name`, `video_file_content_type`, `video_file_file_size`, `created_at`, `updated_at`) VALUES ('naga', 'rails is developed', 1, 'animaldecore.jpg', 'image/jpeg', 14922, '2015-07-10 09:27:18', '383.mp4', 'video/mp4', 383631, '2015-07-10 09:27:18', '2015-07-10 09:27:18')
INSERT INTO `pictures` (`photo_file_name`, `photo_content_type`, `photo_file_size`, `photo_updated_at`, `product_id`, `created_at`, `updated_at`) VALUES ('animaldecore.jpg', 'image/jpeg', 14922, '2015-08-19 12:59:16', '1', '2015-08-19 12:59:16', '2015-08-19 12:59:16')

def load_subcat
  @category = Category.find(params[:category_id])
---
SELECT `sub_categories`.* FROM `sub_categories` WHERE `sub_categories`.`category_id` = '1'

	def edit
		@product= Product.find(params[:id])
---
SELECT  `products`.* FROM `products` WHERE `products`.`id` = 12 LIMIT 1

	def update
		@product= Product.find(params[:id])
---
SELECT  `products`.* FROM `products` WHERE `products`.`id` = 12 LIMIT 1

	def destroy
		@product= Product.find(params[:id])
		@product.destroy
---
SELECT  `products`.* FROM `products` WHERE `products`.`id` = 4 LIMIT 1
DELETE FROM `products` WHERE `products`.`id` = 4