app/controllers/sub_categories_controller.rb

	def index
		@sub_categories= SubCategory.all
---
SELECT `sub_categories`.* FROM `sub_categories`

	def create
		@sub_category = SubCategory.new(sub_category_params)
		if @sub_category.save
---
INSERT INTO `sub_categories` (`name`, `category_id`, `created_at`, `updated_at`) VALUES ('rails1', '1', '2015-07-09 12:02:27', '2015-07-09 12:02:27')

	def show
		@sub_category= SubCategory.find(params[:id])
---
SELECT  `sub_categories`.* FROM `sub_categories` WHERE `sub_categories`.`id` = 1 LIMIT 1

	def destroy
		@sub_category= SubCategory.find(params[:id])
		@sub_category.destroy
---
SELECT  `sub_categories`.* FROM `sub_categories` WHERE `sub_categories`.`id` = 1 LIMIT 1
DELETE FROM `sub_categories` WHERE `sub_categories`.`id` = 1