app/controllers/welcome_controller.rb

	def index
  	@products = Product.order(:title)
---
SELECT `products`.* FROM `products`  ORDER BY `products`.`title` ASC