app/views/categories/_form.html.erb

SELECT `sub_categories`.* FROM `sub_categories`
---
<div class="field">
	<%= select_tag :sub_category_id, options_for_select([["Select Sub_category", ""]] + SubCategory.all.map {|c| [c.name, c.id]}), :onchange => 'select_file(this.value)' %>