app/views/products/_form.html.erb

  <div class="field">
  <%= select_tag :category_id, options_for_select([["Select Category", ""]] + Category.all.map {|c| [c.title, c.id]}), :onchange => 'select_file(this.value)' %>
---
SELECT `categories`.* FROM `categories`